archive/before-2018-11-10/2018-08-24-irc使用.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-10-01 Mon 21:36 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>2018-08-24-irc使用</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Peng Xie" />
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">2018-08-24-irc使用</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org53037f7">1. 注册</a></li>
<li><a href="#org0697ffe">2. 常用命令</a></li>
</ul>
</div>
</div>

<div id="outline-container-org53037f7" class="outline-2">
<h2 id="org53037f7"><span class="section-number-2">1</span> 注册</h2>
<div class="outline-text-2" id="text-1">
<p>
比如我要注册pengpengxp
</p>
<pre class="example">
/nick pengpengxp
/msg nickserv register 密码 邮件地址

-freenode-connect- Due to the persistent ongoing spam, all new connections are
                 being set +R (block messages from unidentified users) and
                 will be scanned for vulnerabilities. This will not harm your
                 computer, and vulnerable hosts will be notified.
-NickServ- An email containing nickname activation instructions has been sent
           to pengpengxppub@sina.com.
</pre>

<p>
这个邮件地址有些irc服务器是必须填的，因为它要求你用来验证注册的。然
后打开邮箱，看里面的提示操作就注册成功了。比如：
</p>
<pre class="example">
/msg NickServ VERIFY REGISTER pengpengxp snuwrmfzzuze
-NickServ- Thank you for verifying your e-mail address! You have taken steps
           in ensuring that your registrations are not exploited.
</pre>
</div>
</div>

<div id="outline-container-org0697ffe" class="outline-2">
<h2 id="org0697ffe"><span class="section-number-2">2</span> 常用命令</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li><p>
注册：
</p>
<pre class="example">
/msg nickserv help
</pre></li>

<li><p>
改昵称：
</p>
<pre class="example">
/nick 新的昵称
</pre></li>

<li><p>
查看某人资料：
</p>
<pre class="example">
/whois 昵称
</pre></li>

<li>查看某IP登录的所有用户：</li>
</ul>
<pre class="example">
/who ip
</pre>

<ul class="org-ul">
<li>查看所有频道里面的人的名单。</li>
</ul>
<pre class="example">
/WHO
</pre>

<ul class="org-ul">
<li><p>
用来加入这个频道，如果这个频道不存在，那么服务器将创建一个这样的频
道，当然，不是所有的服务器都提供这项服务的。
</p>
<pre class="example">
/JOIN #频道名
</pre></li>

<li><p>
用来离开这间屋子，并可以留下您离开的原因。
</p>
<pre class="example">
/PART #频道名 离开频道的原因
</pre></li>

<li><p>
用来退出服务器，并附上退出的原因。
</p>
<pre class="example">
/QUIT 退出的原因
</pre></li>

<li><p>
这命令用来告诉别人你暂时离开一会，比如/AWAY 偶去pmm了， 那么别人和你
开小窗说话，他将看到这样的信息:youname IS AWAY:偶去pmm了。要取消您的
AWAY信息,打/AWAY就行了。
</p>
<pre class="example">
/AWAY 原因
</pre></li>

<li><p>
用来邀请别人到指定频道的命令。
</p>
<pre class="example">
/INVITE 昵称 #频道名
</pre></li>

<li>管理
<ul class="org-ul">
<li><p>
如果您是这个频道的管理员，就可以把你想要踢的人踢出去，并可以说明原
因。
</p>
<pre class="example">
/KICK #频道名 昵称 原因
</pre></li>

<li><p>
如果您是这个频道的管理员，用来改变频道的主题。
</p>
<pre class="example">
/TOPIC #频道名' 频道主题
</pre></li>
</ul></li>

<li>自行</li>

<li><p>
用nick做主语的祈使句
</p>
<pre class="example">
/ME 您要作的动作
</pre></li>

<li><p>
用来向别人单独发送信息的命令。
</p>
<pre class="example">
/MSG 昵称|#频道 要说的话
</pre></li>

<li><p>
用来和别人开小窗来聊天。
</p>
<pre class="example">
/QUERY 昵称 要说的话
</pre></li>

<li><p>
提示，不要用，通常挨踢
</p>
<pre class="example">
/NOTICE 昵称|#频道名 要说的话
</pre></li>

<li>频道
<ul class="org-ul">
<li><p>
查看服务器上所有频道及主题（公共服务器如 Freenode 请慎用，因为太
多）。
</p>
<pre class="example">
/list
</pre></li>

<li><p>
显示#ubuntu-cn这个频道
</p>
<pre class="example">
/list #ubuntu-cn
</pre></li>

<li><p>
现在查看的是人数大于A个人但小于B个人的频道
</p>
<pre class="example">
/list －MIN A －MAX B
</pre></li>

<li><p>
那么您所查看的是所有含有ABC字符串的频道。
</p>
<pre class="example">
/list *ABC*
</pre></li>
</ul></li>

<li>Freenode相关
<ul class="org-ul">
<li><p>
首先找到想要的昵称——已经被注册的就没法用了
</p>
<pre class="example">
/nick 新的昵称
</pre></li>

<li><p>
注册
</p>
<pre class="example">
/msg NickServ REGISTER 密码 电子邮件地址
</pre></li>

<li><p>
密码验明正身
</p>
<pre class="example">
/msg NickServ IDENTIFY 昵称 密码
</pre></li>

<li>验明正身后，换昵称加为额外的名</li>
</ul></li>
</ul>
<pre class="example">
/msg NickServ GROUP
</pre>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Peng Xie</p>
<p class="date">Created: 2018-10-01 Mon 21:36</p>
<p class="validation"></p>
</div>
</body>
</html>